[{"title":"【码农日记01】一个很有意思的想法","date":"2018-05-29T16:00:00.000Z","path":"2018/05/30/【码农日记01】一个很有意思的想法/","text":"&emsp;&emsp;既然选择了就用心去玩味，不喜欢就放下，少一点抱怨和徘徊，人生短短几十年，认定就去做！不知道下一步该怎么走，就做好当下的事！——share猿 时间：2018-11-15天气：多云转小雨星期：星期四 ###序 &emsp;&emsp;我是一名奋斗在二线城市的菜鸟级程序员，大学学的制药工程，从大二开始就一直想自己未来要做什么？大学毕业要什么？想通了未来要做什么，未来要做一名企业家，为这个社会创造更大的价值，但不知道下一步该如何走。终于在大三的时候我想通了，我要进入互联网行业，怎么进入那？就在自己犹豫不决时，一个院系的小伙子给了我思路，学软件，搞编程，就这样入了这个坑，后来在我小姨家哥的帮助下选择了java这门高大上的语言，真的是一入java深似海呀！到大三下半学期开始自学，除了考二级的时候学过一点vb，再根本没有一点软件基础，现在想想真的佩服自己当时的勇气，每天抱着电脑看传智播客的视频，刚开始看的那种感觉真心难受，一遍看完根本不知道人家在说什么，强忍着泪花把这一套视频看完，看完感觉跟没看差不多。 &emsp;&emsp;后来，在一次和发小聊天中了解到，他也是做软件开发的，我咨询了他让他给我一点建议，他建议我想找一份实习的工作，然后边干边学习，慢慢的就提高了！我要到了他们公司人事的电话，沟通过后在智联招聘上投了简历，很幸运约到了面试，面试当天穿的西装革履，带着打印的彩色简历，现在想想真的很怀恋那时候对一件事的坚持和热情，有时候对人对事的态度真的很重要，一件事一个人你从内心用什么态度一般情况下就会预示着未来会取得什么样的结果，用真心去生活真的很重要，知道自己要什么？做什么？未来要成为什么样的人？心中要有尺度！面试过后我也入愿进入一家在家乡比较大的软件公司开始了我的软件生涯，一直到现在，在这儿过程中遇到了很多挫折，好多问题其实只要别人指导一下就可以解决，但是死磕到底虽然解决了问题但是效率不高，没有真正将时间用在刀刃上，为此那我想通过记录我这个菜鸟每天的软件历程以及在日常工作的所感所悟记录下来，希望能给这个行业带来一些价值，为这个社会带来一些价值，我认为一个人活着的意义在于创造。 ###想法 &emsp;&emsp;把自己在软件行业的每天所感所悟所学记录下来，一方面作为自己对一天生活的总结和下一天生活的计划，另一方面希冀能够为共同奋斗在一线行业的同行们提供一些行业知识的素材，可能我的诸多理解很浅显或者是错的，大家可以提出来指正，把我们共同的故事记录在这里为后来人带来些许帮助。 ###日记更新周期 &emsp;&emsp;工作日必更，节假日看更！ ###今日历程 &emsp;&emsp;今天的主要工作是大家在一起测试各自的接口，为什么大家要做在一起测，老大说大家做在一起测试一方面可以测试出接口存在的问题，同时大家可以在一起商量重构代码和整体的架构微调，大家不做在一个桌面上，有些问题是没办法暴露出来的，团队成员也感知不到各自之间的差距，大家做到一起才能真正的切实感触到，事实证明这次测试效果很好。 &emsp;&emsp;比较遗憾的是我今天没有准备充分，耽误了大家很多时间我感到很愧疚。究其原因主要在自己对每天的工作没有计划导致的，尤其像这种团体性活动更不能粗心大意，不然到头你耽误的是大家的时间，每人十分钟一个小时就过去了，这是赤裸裸的“谋财害命”，只有尊重大家的时间才能得到大家的尊重，我深刻的检讨自己此次在工作中的失误，那么在接口测试中需要做什么预备工作那？？？我简单的列举一下我的总结，大家如果觉得缺少什么可以在评论中做以补充，谢谢！ 笔记本准备（我本次就是因为安装了ubuntu桌面版的系统没有安装好相关软件耽误了大家的时间） 代码规范约文档 测试环境 测试数据 postman接口整理 接口文档整理 &emsp;&emsp;相信经过以上的准备，大家在一起测接口的过程中会事半功倍，效率更高。在测试的过程中要及时的记录问题，梳理成文档，方便团队成员之间进行查阅，因为好多问题都是共性的问题，一旦发现成员在下去就可以及时修改，这是一个良性循环，这样在后面问题也会越来越少，测试效率也越来越高。 本次测试过程中我总体感觉是没有秩序，究其原因我总结了以下几点： 流程不明确（大家一起先测接口还是先看代码，接口测试是先测接口是否正常还是先测参数问题等等我觉得这些都是可以流程化的东西） 准备资料不全（比如：postman接口谁开发的就可以谁录好，大家共同登录，因为postman本然就是可以多人同时在线的，或者导出来发给大家。） 在本次测试中也发现了很多问题，让我受益良多，下面我一一列举。 没有定义规范导致在开发过程中团队成员之间代码每个人都不一样。比如注释规范没有定义导致出现了多种不同的注释方式，路径命名规定没定义，有的人在路径前面加了api/v1（加这个的意义在于代码的升级），大家引用的常量不一样，通用字段的命名和类型长度不一样，处理异常的方式不一样，返回码不统一，校验方式不统一等等，我个人认为，这些事应当是架构师统一去约定和规范，好的架构师一方面要保证架构的稳定，同时还要约定要规范，包装好一些通用的东西，这样才能让下面的人更好的去开发。 枚举类型没有检验。在java的参数检验中我们常用封装好Spring-validate进行校验，这里只提供一些基本的检验，比如非空校验、长度检验。要检验枚举我们只能自己自定义注解去校验了，自定义注解我们可以在网上搜到，这里不做过多的阐述，大家可以自己去寻找，总结出自己的套路和方法，好多事情没有咱们想的那么难。 接口要保持单一性。在这次测试过程中遇到一个问题，我把新增和编辑写成了同一个接口，我们在常规作miss系统的过程中一般是这样去做的，但是在接口开发中为什么要分开那？听了老大的讲解后恍然大悟，分开确实有分开的道理，首先是方便前端人员的对接，另一方面新增和编辑里面的逻辑也不一样，分开可以处理各自的业务和逻辑。 给前端返回实体。在miss系统中我们一般是全部返回的，但是在接口开发中，前端需要什么就返回什么，我们可以新定义一个vo去返回给前端，这样一方面避免把自己的数据库结构爆露出去，防止敏感字段的泄漏，让对接的接口的前端人员也更加舒服，让自己代码可读性好，让别人看着自己代码或者文档舒心这是程序员的基本素养。在实体相关值复制到vo的过程中，我一开始用的BeanUtis去copy的，但是大家说这样效率有点低下可以用Json进行复制效率相对高一点。 ###感悟 &emsp;&emsp;牛逼的技术非一日之功，要沉下心慢慢去沉淀，多向身边的人去学习，学识不分大小，这个行业不分资历只凭学识，活到老学到老。 &emsp;&emsp;今天的日记就写到这里，第一天写有诸多的不足，希望大家及时提出，我不怕喷。 【1】简书主页·share猿【2】掘金主页·share猿 扫描以下公众号关注小猿↓↓↓↓↓↓↓↓ 更多资讯请在简书、微博、今日头条、掘金、CSDN都可以通过搜索“Share猿”找到小猿哦！！！","tags":[{"name":"日记","slug":"日记","permalink":"https://lywlefan.github.io/tags/日记/"},{"name":"思考","slug":"思考","permalink":"https://lywlefan.github.io/tags/思考/"}]}]